lar-app/app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        return view('admin.allCategories', [
            'categories' => Category::all()
        ]);
---
select * from `categories`

    public function create()
    {
        return view('admin.category.create',[
            'categories' => Category::all()
        ]);
---
select * from `categories`

    public function edit(Category $category)
    {
        return view('admin.category.edit',
        [
            'categories' => Category::all(),
            'category' => $category
        ]);
---
select * from `categories`