lar-app/app/Http/Controllers/Admin/NewsController.php

    public function index() {
//        $news = DB::table('news')
//            ->join('categories', 'categories.id', '=', 'news.category_id')
//            ->select('news.*', 'categories.title as category_title' )
//            ->orderBy('id')
//            ->get();

        return view('admin.allNews', [
            'news' => News::paginate(5),
            'categories' => Category::all(),
            'categoriesTitle' => Category::query()->select(['id', 'title'])->get()
        ]);
---
select `id`, `title` from `categories`
select count(*) as aggregate from `news`
select * from `categories`

    public function create()
    {
        return view('admin.news.create', [
            'categories' => Category::all()
        ]);
---
select * from `categories`

    public function edit(News $news)
    {
        return view('admin.news.edit',[
            'news' => $news,
            'categories' =>  Category::all()
        ]);
---
select * from `categories`