lar-new/app/Http/Controllers/Admin/CategoryController.php

select * from `categories`
---
    public function index()
    {
        return view('admin.allCategories', [
            'categories' => Category::all()
        ]);