lar-new/app/Http/Controllers/Admin/IndexController.php

    public function index() {
        return view('admin.index', [
            'categories' => Category::all()
        ]);
---
select * from `categories`