lar-new/app/Http/Controllers/Admin/NewsController.php

select count(*) as aggregate from `news`
select `id`, `title` from `categories`
select `id`, `title` from `sources`
---
    public function index() {
        return view('admin.allNews', [
            'news' => News::orderByDesc('created_at')->paginate(10),
//            'categories' => Category::all(),
            'categoriesTitle' => Category::query()->select(['id', 'title'])->get(), //???
            'sourcesTitle' => Source::query()->select(['id', 'title'])->get()
        ]);

select * from `categories`
---
    public function create()
    {
        return view('admin.news.create', [
            'categories' => Category::all()
        ]);

select * from `categories`
---
    public function edit(News $news)
    {
        return view('admin.news.edit',[
            'news' => $news,
            'categories' =>  Category::all()

update `news` set `text` = '<blockquote><p>Министр иностранных дел Киргизии Руслан Казакбаев отправлен в отставку. Об этом сообщили в пресс-службе администраци<i><strong>и главы республики. П</strong></i>резидент Садыр Жапаров подписал указ, согласно которому Казакбаев освобожден от занимаемой должности. Он возглавлял МИД Киргизии с октября 2020 года.</p></blockquote>', `news`.`updated_at` = '2022-04-22 20:36:03' where `id` = 1
---
    public function update(NewsRequest $request,News $news): \Illuminate\Http\RedirectResponse
    {

        $validated = $request->validated();
        // это будет массив с проверенными заполненными полями данными, которые пришли из формы

        if ($request->hasFile('image')) {
            $service = app(UploadService::class);
            $validated['image'] = $service->uploadFile($request->file('image')); // путь до файла, который мы загрузим в БД
        }

        $saveStatus = $news->fill($validated)->save();