lar-app/app/Http/Controllers/IndexController.php

select * from `categories`
---
    public function index() {
        return view('index', [
            'categories' => Category::all()
        ]);