lar-app/app/Http/Controllers/NewsController.php

select * from `news` limit 10 offset 0
select count(*) as aggregate from `news`
select * from `categories`
---
    public function index() {
        $news = News::paginate(10);

        return view('news.index', [
            'categories' => Category::all(),
            'news' => $news
        ]);

select * from `news` where `news`.`id` = 31 limit 1
select * from `categories`
---
    public function show(int $id)
        {
            //$news = DB::select('SELECT * FROM `news` WHERE id = :id', ['id' => $id]);
//            $news = DB::table('news')->find($id); //getOne($id)
            $news = News::find($id);

            return view('news.one', [
                'categories' => Category::all(),
                'news' => $news
            ]);