lar-new/app/Http/Controllers/NewsController.php

select * from `news` limit 10 offset 0
select count(*) as aggregate from `news`
---
    public function index() {
        $news = News::paginate(10);

select * from `news` where `news`.`id` = 102 limit 1
---
    public function show(int $id)
    {
        //$news = DB::select('SELECT * FROM `news` WHERE id = :id', ['id' => $id]);
//            $news = DB::table('news')->find($id); //getOne($id)
        $news = News::find($id);